app/controllers/movies_controller.rb

SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'G', 'PG-13')
---
  def index
    @all_ratings =  Movie.pluck(:rating).uniq
    @selected_ratings = []

    unless params[:ratings].nil?
      keys = params[:ratings].keys
      keys.each do |key|
        @selected_ratings << key.to_s
      end
    else
       @all_ratings.each do |one_rating|